package 월급관리프로그램;

public class Ex00_추상기초 {
	
	// 추상화
	// : 객체 간의 공통점을 찾아내서 공통의 조상을 만드는 작업
	//   상속 계층도를 따라 올라갈 수록 클래스의 추상화가 더욱 심화된다!!
	//  ex) 동물 -> 조류, 양서류, 포유류, 어류 -> 참새, 비둘기, 까치, 닭
	
	
	// 추상메서드 (Abstract Method)
	// : 선언은 되어있지만 기능이 구현되지 않은 메서드
	//  => 서브 클래스에서 추상메서드를 오버라이딩해서 기능 구현
	//   -> 선언방법
	//    : abstract 키워드로 선언
	//    ex) public abstract void wing();
	
	// 추상클래스 (Abstract Class)
	// : 추상 메서드를 단 하나라도 가지고 있으면 추상클래스가 반드시!!!!! 되어야 함!!!!!!
	//   ->여러 클래스들 간에 공통인 필드나 메소드를 추출해서 만든 클래스!
	// 추상메서드가 하나도 없어도 클래스 앞에 abstract 입력하면 추상클래스가 된다!
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
